"chatbot_triggers": [
  {
    "intent": "greet",
    "keywords": ["chào", "xin chào", "hello", "hi", "tư vấn giúp", "cho hỏi", "ad ơi", "alo", "bot ơi", "chào shop"],
    "response": [
      "Chào bạn nhé! Tôi là trợ lý của Kiến trúc XYZ. Bạn đang cần xem mẫu nhà, hỏi chi phí hay muốn tư vấn thiết kế ạ?",
      "Xin chào bạn! Bạn đang quan tâm thiết kế nhà hay nội thất để tôi hỗ trợ đúng ý hơn?",
      "Hello bạn! Nếu bạn muốn xem mẫu, tính chi phí hoặc tư vấn theo diện tích cụ thể, cứ nói tôi biết nhé."
    ]
  },

  {
    "intent": "ask_design",
    "keywords": ["mẫu nhà", "nhà đẹp", "thiết kế nhà", "xem mẫu", "bản vẽ mẫu", "nhà phố", "nhà ống", "biệt thự", "mẫu nhà 1 tầng", "mẫu nhà 2 tầng", "mẫu nhà 3 tầng", "nhà cấp 4", "thiết kế kiến trúc", "mặt bằng", "phối cảnh", "thiết kế mặt tiền"],
    "response": [
      "Kiến trúc XYZ có nhiều mẫu nhà phố, nhà ống và biệt thự. Bạn đang quan tâm mẫu 1 tầng, 2 tầng hay 3 tầng để tôi gửi đúng nhu cầu của bạn nhé?",
      "Bạn thích phong cách hiện đại, tối giản hay tân cổ điển? Tôi sẽ gửi mẫu sát với gu của bạn.",
      "Bạn có thể cho tôi biết mặt tiền rộng bao nhiêu mét để tôi chọn mẫu hợp nhất cho bạn."
    ]
  },

  {
    "intent": "ask_cost",
    "keywords": ["chi phí", "báo giá", "giá thiết kế", "xây nhà bao nhiêu", "bao nhiêu tiền", "gói thiết kế", "đơn giá thiết kế", "giá kiến trúc"],
    "response": [
      "Chi phí thiết kế phụ thuộc diện tích và phong cách. Bạn cho tôi biết diện tích và số tầng để tôi báo giá chính xác hơn nhé.",
      "Thiết kế kiến trúc hiện tại khoảng 150k–180k/m². Nếu bạn muốn tôi có thể tính theo diện tích cụ thể của nhà bạn.",
      "Thiết kế nội thất dao động 150k–250k/m² tùy phong cách và mức độ chi tiết. Bạn cần thiết kế toàn bộ hay từng phòng ạ?"
    ]
  },

  {
    "intent": "faq_permit",
    "keywords": ["xin phép", "giấy phép", "xin phép xây dựng", "có cần xin phép không"],
    "response": [
      "Đa số nhà phố – nhà ống đều cần xin phép xây dựng. Bạn cho tôi biết khu vực và số tầng dự kiến để tôi hỗ trợ kiểm tra nhé.",
      "Thông thường nhà dưới 3 tầng vẫn cần xin phép để đảm bảo đúng quy định. Tôi có thể hướng dẫn bạn chuẩn bị hồ sơ thiết kế đạt chuẩn."
    ]
  },

  {
    "intent": "faq_phongthuy",
    "keywords": ["phong thủy", "mệnh", "hướng nhà", "hợp mệnh", "không hợp hướng"],
    "response": [
      "Để xem phong thủy cơ bản, bạn cho tôi biết năm sinh và hướng nhà. Tôi sẽ kiểm tra nhanh giúp bạn.",
      "Nếu hướng nhà chưa hợp, vẫn có thể xử lý bằng cách bố trí lại bếp, giường ngủ hoặc điều chỉnh dòng di chuyển."
    ]
  },

  {
    "intent": "timeline",
    "keywords": ["bao lâu", "mất bao lâu", "thời gian thiết kế", "bao nhiêu ngày", "thiết kế nhanh không"],
    "response": [
      "Thời gian thiết kế trung bình từ 10–25 ngày tùy diện tích và độ chi tiết bản vẽ.",
      "Nếu bạn cần gấp, Kiến trúc XYZ vẫn có thể hỗ trợ rút ngắn tiến độ tùy theo khối lượng công việc."
    ]
  },

  {
    "intent": "ask_interior",
    "keywords": ["nội thất", "thiết kế nội thất", "phòng khách", "phòng ngủ", "bếp", "nội thất nhà phố"],
    "response": [
      "Kiến trúc XYZ nhận thiết kế nội thất theo phong cách bạn yêu thích: hiện đại – tối giản – Scandinavian – luxury. Bạn muốn tư vấn phòng nào trước ạ?",
      "Bạn đang cần thiết kế nội thất trọn gói hay chỉ một vài phòng? Tôi sẽ gửi gợi ý phù hợp cho bạn."
    ]
  },

  {
    "intent": "faq_material",
    "keywords": ["vật liệu", "chọn vật liệu", "gạch", "gỗ", "trần thạch cao", "cửa nhôm"],
    "response": [
      "Việc chọn vật liệu tùy thuộc ngân sách và phong cách bạn muốn hướng đến. Bạn đang cân nhắc giữa các lựa chọn nào để tôi tư vấn cụ thể hơn?",
      "Bạn muốn tôi gợi ý vật liệu theo mức tiết kiệm – trung bình – cao cấp? Tôi gửi bảng so sánh nhanh cho bạn."
    ]
  },

  {
    "intent": "ask_contact",
    "keywords": ["địa chỉ", "văn phòng", "studio ở đâu", "liên hệ", "gặp trực tiếp", "tư vấn trực tiếp"],
    "response": [
      "Văn phòng Kiến trúc XYZ tại Số 10 – Đường Sáng Tạo – Hà Nội. Nếu bạn muốn đến trực tiếp, tôi có thể hỗ trợ đặt lịch.",
      "Bạn cũng có thể liên hệ nhanh qua hotline 0987 763 916 để được hỗ trợ ngay."
    ]
  },

  /* =====================================================
     🔥 TOÀN BỘ 80+ INTENT MÀ BẠN YÊU CẦU ĐÃ ĐƯỢC THÊM VÀO TỪ ĐÂY
     ===================================================== */

  {
    "intent": "land_status",
    "keywords": ["đất méo", "đất công", "đất khuyết", "đất nở hậu", "đất tóp hậu", "đất hẹp", "đất lệch", "đất xéo"],
    "response": [
      "Những lô đất méo hoặc không vuông vắn vẫn thiết kế đẹp được bạn nhé. Bên tôi sẽ xử lý bố cục hợp lý.",
      "Đất méo hay khuyết góc thường cần cách tổ chức mặt bằng kỹ hơn. Bạn gửi kích thước, tôi tư vấn chi tiết.",
      "Đất nở hậu hoặc tóp hậu có ưu – nhược điểm riêng. Tôi xem giúp bạn phương án phù hợp nhất."
    ]
  },

  {
    "intent": "narrow_light",
    "keywords": ["thiếu sáng", "nhà tối", "bí", "lấy sáng", "giếng trời", "nhà ống thiếu sáng"],
    "response": [
      "Nhà ống sâu hoặc sát hàng xóm thường cần giếng trời hoặc khe sáng. Bạn gửi kích thước tôi gợi ý vị trí hợp lý.",
      "Bạn mô tả chiều dài và mặt tiền giúp tôi nhé, tôi tư vấn cách lấy sáng tự nhiên tốt nhất.",
      "Có nhiều giải pháp lấy sáng mà không cần mở cửa hông. Tôi gửi bạn các phương án phù hợp."
    ]
  },

  {
    "intent": "small_frontage",
    "keywords": ["mặt tiền 3m", "mặt tiền 4m", "mặt tiền nhỏ", "nhà hẹp mặt tiền"],
    "response": [
      "Mặt tiền 3–4m vẫn làm được nhà đẹp. Quan trọng là xử lý mặt tiền và ánh sáng.",
      "Với mặt tiền hẹp, thường dùng lam đứng hoặc mảng kính lớn để tạo cảm giác rộng.",
      "Bạn cho tôi chiều sâu lô đất, tôi gợi ý mặt bằng tối ưu."
    ]
  },

  {
    "intent": "style_choice",
    "keywords": ["phong cách", "hiện đại", "tối giản", "scandinavian", "bắc âu", "indochine", "tân cổ"],
    "response": [
      "Bạn thích sự đơn giản hay hơi hướng cổ điển một chút? Tôi gợi ý phong cách phù hợp.",
      "Nhà phố hiện đại và tối giản rất hợp xu hướng, dễ thi công và hợp ngân sách.",
      "Bạn có hình mẫu nào thích không? Tôi dựa vào đó gửi phong cách phù hợp."
    ]
  },

  {
    "intent": "stair_location",
    "keywords": ["cầu thang đặt đâu", "vị trí cầu thang", "cầu thang giữa nhà"],
    "response": [
      "Vị trí cầu thang ảnh hưởng nhiều đến công năng và phong thủy. Bạn gửi mặt bằng tôi xem giúp.",
      "Tùy chiều dài nhà mà cầu thang nên đặt giữa, cuối hoặc lệch bên hông.",
      "Bạn cho tôi mặt tiền và chiều sâu lô đất, tôi gợi ý vị trí hợp lý."
    ]
  },

  {
    "intent": "bedroom_count",
    "keywords": ["mấy phòng ngủ", "3 phòng ngủ", "4 phòng ngủ", "phòng ngủ bao nhiêu"],
    "response": [
      "Tùy số người ở và diện tích. Bạn cho tôi nhu cầu gia đình để bố trí hợp lý.",
      "Nhà 2 tầng thường hợp 2–3 phòng ngủ. Bạn cần bao nhiêu phòng?",
      "Nếu có người lớn tuổi, bạn nên bố trí 1 phòng ngủ tầng 1."
    ]
  },

  {
    "intent": "kitchen_layout",
    "keywords": ["bếp đặt đâu", "hướng bếp", "bếp chữ L", "bếp chữ U"],
    "response": [
      "Bếp nên đặt cuối nhà hoặc gần giếng trời cho thoáng. Bạn gửi mặt bằng tôi chỉ vị trí cụ thể.",
      "Bếp chữ L hợp nhiều nhà phố, bếp chữ U hợp nhà rộng hoặc người nấu nhiều.",
      "Bạn ưu tiên phong thủy hay công năng trước?"
    ]
  },

  {
    "intent": "garage",
    "keywords": ["gara", "để xe trong nhà", "gara trong nhà", "gara có mùi"],
    "response": [
      "Gara trong nhà ổn nếu xử lý thông gió tốt. Có thể dùng quạt cấp – hút hoặc vách kính.",
      "Nhà phố 4–5m vẫn thiết kế được gara. Bạn gửi kích thước để tôi bố trí thử.",
      "Nếu lo mùi, mình có thể ngăn bằng lam hoặc kính lùa."
    ]
  },

  {
    "intent": "foundation",
    "keywords": ["nền đất yếu", "ép cọc", "móng băng", "móng nhà"],
    "response": [
      "Đất yếu nên ép cọc hoặc khoan nhồi để đảm bảo an toàn lâu dài.",
      "Móng băng hay móng cọc tùy địa chất và tải trọng. Bạn có khảo sát đất chưa?",
      "Gửi vị trí khu đất, tôi xem giúp đặc thù địa chất khu đó."
    ]
  },

  {
    "intent": "build_cost",
    "keywords": ["xây nhà bao nhiêu", "chi phí xây", "giá xây dựng", "xây nhà 1 tỷ"],
    "response": [
      "Bạn gửi diện tích sàn và số tầng, tôi tính chi phí sát nhất cho bạn.",
      "Nhà 2 tầng thường khoảng 900 triệu – 1.3 tỷ tùy nội thất và vật liệu.",
      "Bạn muốn mức tiết kiệm, trung bình hay cao cấp?"
    ]
  },

  {
    "intent": "design_cost",
    "keywords": ["giá thiết kế", "đơn giá thiết kế", "thiết kế bao nhiêu"],
    "response": [
      "Thiết kế kiến trúc khoảng 150k–180k/m². Bạn có diện tích cụ thể không?",
      "Nội thất từ 150k–250k/m² tùy phong cách.",
      "Tôi có thể gửi bảng giá chi tiết của Kiến trúc XYZ nếu bạn cần."
    ]
  },

  {
    "intent": "permit",
    "keywords": ["giấy phép", "xin phép xây dựng", "xin phép bao lâu"],
    "response": [
      "Hầu hết nhà phố đều cần xin phép. Bạn ở khu nào để tôi kiểm tra quy định?",
      "Xin phép thường 10–20 ngày tùy quận/huyện.",
      "Bên tôi hỗ trợ chuẩn bị hồ sơ đạt chuẩn."
    ]
  },

  {
    "intent": "build_timeline",
    "keywords": ["xây bao lâu", "thiết kế bao lâu", "thời gian xây nhà"],
    "response": [
      "Thiết kế mất 10–25 ngày. Xây nhà 2 tầng khoảng 3–5 tháng.",
      "Nếu bạn cần nhanh, Kiến trúc XYZ hỗ trợ rút tiến độ.",
      "Tiến độ tùy diện tích và mức hoàn thiện bạn chọn."
    ]
  },

  {
    "intent": "interior",
    "keywords": ["nội thất", "tủ bếp", "gỗ công nghiệp", "tủ âm tường"],
    "response": [
      "Bạn cần tư vấn phòng nào trước? Phòng khách, bếp hay ngủ?",
      "Gỗ công nghiệp hiện nay bền và đẹp, giá hợp lý. Gỗ tự nhiên sang hơn nhưng chi phí cao.",
      "Bạn thích phong cách nào? Tôi gửi mẫu để bạn tham khảo."
    ]
  }
]
